## Staging: pinpoint_to_sqs_sms_callbacks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 11 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                                  NAME                                                   |
|----------|---------------------------------------------------------------------------------------------------------|
| add      | `aws_cloudwatch_log_metric_filter.pinpoint_to_sqs_sms_callbacks-500-errors-api[0]`                      |
|          | `aws_cloudwatch_log_subscription_filter.pinpoint_deliveries_ca_central_to_lambda[0]`                    |
|          | `aws_cloudwatch_log_subscription_filter.pinpoint_deliveries_failures_ca_central_to_lambda[0]`           |
|          | `aws_cloudwatch_metric_alarm.lambda-image-pinpoint-delivery-receipts-errors-critical[0]`                |
|          | `aws_cloudwatch_metric_alarm.lambda-image-pinpoint-delivery-receipts-errors-warning[0]`                 |
|          | `aws_cloudwatch_metric_alarm.logs-1-500-error-1-minute-warning-pinpoint_to_sqs_sms_callbacks-api[0]`    |
|          | `aws_cloudwatch_metric_alarm.logs-10-500-error-5-minutes-critical-pinpoint_to_sqs_sms_callbacks-api[0]` |
|          | `aws_lambda_permission.allow_cloudwatch_logs_pinpoint_failures[0]`                                      |
|          | `aws_lambda_permission.allow_cloudwatch_logs_pinpoint_successes[0]`                                     |
|          | `module.pinpoint_to_sqs_sms_callbacks.aws_lambda_function.this`                                         |
| recreate | `null_resource.create_pools`                                                                            |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.pinpoint_to_sqs_sms_callbacks-500-errors-api[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "pinpoint_to_sqs_sms_callbacks-500-errors-api" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/pinpoint_to_sqs_sms_callbacks"
      + name           = "pinpoint_to_sqs_sms_callbacks-500-errors-api"
      + pattern        = "\"\\\"levelname\\\": \\\"ERROR\\\"\""

      + metric_transformation {
          + name      = "500-errors-pinpoint_to_sqs_sms_callbacks-api"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_log_subscription_filter.pinpoint_deliveries_ca_central_to_lambda[0] will be created
  + resource "aws_cloudwatch_log_subscription_filter" "pinpoint_deliveries_ca_central_to_lambda" {
      + destination_arn = (known after apply)
      + distribution    = "ByLogStream"
      + id              = (known after apply)
      + log_group_name  = "sns/ca-central-1/239043911459/PinPointDirectPublishToPhoneNumber"
      + name            = "pinpoint_deliveries_ca_central"
      + role_arn        = (known after apply)
    }

  # aws_cloudwatch_log_subscription_filter.pinpoint_deliveries_failures_ca_central_to_lambda[0] will be created
  + resource "aws_cloudwatch_log_subscription_filter" "pinpoint_deliveries_failures_ca_central_to_lambda" {
      + destination_arn = (known after apply)
      + distribution    = "ByLogStream"
      + id              = (known after apply)
      + log_group_name  = "sns/ca-central-1/239043911459/PinPointDirectPublishToPhoneNumber/Failure"
      + name            = "pinpoint_deliveries_failures_ca_central"
      + role_arn        = (known after apply)
    }

  # aws_cloudwatch_metric_alarm.lambda-image-pinpoint-delivery-receipts-errors-critical[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "lambda-image-pinpoint-delivery-receipts-errors-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + alarm_description                     = "20 errors on Lambda pinpoint-to-sqs-sms-callbacks in 10 minutes"
      + alarm_name                            = "lambda-image-pinpoint-delivery-receipts-errors-critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "FunctionName" = "pinpoint_to_sqs_sms_callbacks"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-ok",
        ]
      + period                                = 600
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 20
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.lambda-image-pinpoint-delivery-receipts-errors-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "lambda-image-pinpoint-delivery-receipts-errors-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "5 errors on Lambda pinpoint-to-sqs-sms-callbacks in 10 minutes"
      + alarm_name                            = "lambda-image-pinpoint-delivery-receipts-errors-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "FunctionName" = "pinpoint_to_sqs_sms_callbacks"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-ok",
        ]
      + period                                = 600
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 5
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.logs-1-500-error-1-minute-warning-pinpoint_to_sqs_sms_callbacks-api[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-1-500-error-1-minute-warning-pinpoint_to_sqs_sms_callbacks-api" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "One 500 error in 1 minute for pinpoint_to_sqs_sms_callbacks api"
      + alarm_name                            = "logs-1-500-error-1-minute-warning-pinpoint_to_sqs_sms_callbacks-api"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "500-errors-pinpoint_to_sqs_sms_callbacks-api"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.logs-10-500-error-5-minutes-critical-pinpoint_to_sqs_sms_callbacks-api[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-10-500-error-5-minutes-critical-pinpoint_to_sqs_sms_callbacks-api" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + alarm_description                     = "Ten 500 errors in 5 minutes for pinpoint_to_sqs_sms_callbacks api"
      + alarm_name                            = "logs-10-500-error-5-minutes-critical-pinpoint_to_sqs_sms_callbacks-api"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "500-errors-pinpoint_to_sqs_sms_callbacks-api"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-ok",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 10
      + treat_missing_data                    = "notBreaching"
    }

  # aws_lambda_permission.allow_cloudwatch_logs_pinpoint_failures[0] will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_logs_pinpoint_failures" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "pinpoint_to_sqs_sms_callbacks"
      + id                  = (known after apply)
      + principal           = "logs.ca-central-1.amazonaws.com"
      + source_arn          = "arn:aws:logs:ca-central-1:239043911459:log-group:sns/ca-central-1/239043911459/PinPointDirectPublishToPhoneNumber/Failure:*"
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # aws_lambda_permission.allow_cloudwatch_logs_pinpoint_successes[0] will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_logs_pinpoint_successes" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "pinpoint_to_sqs_sms_callbacks"
      + id                  = (known after apply)
      + principal           = "logs.ca-central-1.amazonaws.com"
      + source_arn          = "arn:aws:logs:ca-central-1:239043911459:log-group:sns/ca-central-1/239043911459/PinPointDirectPublishToPhoneNumber:*"
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # null_resource.create_pools is tainted, so must be replaced
-/+ resource "null_resource" "create_pools" {
      ~ id = "2309151948328201087" -> (known after apply)
    }

  # module.pinpoint_to_sqs_sms_callbacks.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = [
          + "x86_64",
        ]
      + arn                            = (known after apply)
      + function_name                  = "pinpoint_to_sqs_sms_callbacks"
      + id                             = (known after apply)
      + image_uri                      = "239043911459.dkr.ecr.ca-central-1.amazonaws.com/notify/pinpoint_to_sqs_sms_callbacks:bootstrap"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::239043911459:role/pinpoint_to_sqs_sms_callbacks"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + ephemeral_storage {
          + size = 512
        }

      + tracing_config {
          + mode = "PassThrough"
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + vpc_id                      = (known after apply)
        }
    }

Plan: 11 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.pinpoint_deliveries"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.pinpoint_deliveries_failures"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.pinpoint_to_sqs_sms_callbacks_log_group[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-image-pinpoint-delivery-receipts-errors-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-image-pinpoint-delivery-receipts-errors-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-500-error-1-minute-warning-pinpoint_to_sqs_sms_callbacks-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-500-error-5-minutes-critical-pinpoint_to_sqs_sms_callbacks-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.pinpoint_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.pinpoint_logs"]

28 tests, 19 passed, 9 warnings, 0 failures, 0 exceptions

```

</details>
